try:
    import os, time, venv
    from APySC.PATHS import PATH_FLD, PATH_FLE, CNST_TXT
    
except ImportError as e:
    print(f"Not enough trace dependencies: {e}")

if __name__ == "__main__":
    sep = '-' * 15

    start = time.time()

    print('''

░█████╗░██████╗░██╗░░░██╗░██████╗░█████╗░
██╔══██╗██╔══██╗╚██╗░██╔╝██╔════╝██╔══██╗
███████║██████╔╝░╚████╔╝░╚█████╗░██║░░╚═╝
██╔══██║██╔═══╝░░░╚██╔╝░░░╚═══██╗██║░░██╗
██║░░██║██║░░░░░░░░██║░░░██████╔╝╚█████╔╝
╚═╝░░╚═╝╚═╝░░░░░░░░╚═╝░░░╚═════╝░░╚════╝░

░██████╗████████╗░█████╗░██████╗░████████╗░░░░░░░░░
██╔════╝╚══██╔══╝██╔══██╗██╔══██╗╚══██╔══╝░░░░░░░░░
╚█████╗░░░░██║░░░███████║██████╔╝░░░██║░░░░░░░░░░░░
░╚═══██╗░░░██║░░░██╔══██║██╔══██╗░░░██║░░░░░░░░░░░░
██████╔╝░░░██║░░░██║░░██║██║░░██║░░░██║░░░██╗██╗██╗
╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝╚═╝╚═╝''')

    # ДОБАВИТЬ ПРОВЕРКУ НА НАЛИЧИЕ СУЩ. БИБЛИОТЕКИ.
    venv.create('venv')
    
    try:
        for el in PATH_FLD:
            print(f'[Spent: {round(time.time() - start, 3)}]: Create {el}')

            os.makedirs(el, exist_ok=True)
            

        for el in PATH_FLE:
            print(f'[Spent: {round(time.time() - start, 3)}]: Create {el}')

            if el == '.gitignore' and os.path.exists('./venv'): open('.gitignore', "w", encoding="UTF-8").write(CNST_TXT)
            else: open(el, "x", encoding="UTF-8")


    except FileExistsError as e: print(f"The following files already exist: {e}")

    finally: 
        print('''
░█████╗░██████╗░██╗░░░██╗░██████╗░█████╗░
██╔══██╗██╔══██╗╚██╗░██╔╝██╔════╝██╔══██╗
███████║██████╔╝░╚████╔╝░╚█████╗░██║░░╚═╝
██╔══██║██╔═══╝░░░╚██╔╝░░░╚═══██╗██║░░██╗
██║░░██║██║░░░░░░░░██║░░░██████╔╝╚█████╔╝
╚═╝░░╚═╝╚═╝░░░░░░░░╚═╝░░░╚═════╝░░╚════╝░

███████╗██╗███╗░░██╗██╗░██████╗██╗░░██╗██╗
██╔════╝██║████╗░██║██║██╔════╝██║░░██║██║
█████╗░░██║██╔██╗██║██║╚█████╗░███████║██║
██╔══╝░░██║██║╚████║██║░╚═══██╗██╔══██║╚═╝
██║░░░░░██║██║░╚███║██║██████╔╝██║░░██║██╗
╚═╝░░░░░╚═╝╚═╝░░╚══╝╚═╝╚═════╝░╚═╝░░╚═╝╚═╝''')

        print(f"{sep} \n[Spent {round(time.time() - start, 3)}]: AutoPy created the project structure successfully \n{sep}")




